#ax^3 + bx^2 + cx + d = 0 a != 0
a, b, c, d = map(float, input("Введите коэффициенты a, b, c, d, разделенные пробелами: ").split())
#x^3 + Ax^2 + Bx + C = 0
A = b / a
B = c / a
C = d / a

#y^3 + py + q = 0
p = B - (A**2)/3
q = C + 2*(A**3)/27 - A*B/3
# t^2 + qt - p^3/27 = 0
t = (-q - (1 - 2 *(q < 0)) * (q**2 + 4*(p**3)/27)**0.5) / 2

u = t**(1/3)
v = 3*t**(1/3) + (t == 0)
omega = (-0.5 + (3 ** 0.5)* 1j/2)
y1 = u - p/(v)
y2 = u * omega - p/(v) * omega**2
y3 = u * omega**2 - p/(v) * omega

x1 = y1 - A/3
x2 = y2 - A/3
x3 = y3 - A/3

print(f"Выражение: {a}x^3 + {b}x^2 + {c}x + {d} = 0\n")
print(f"Преобразованное уравнение: y^3 + {p}y + {q} = 0\n")
print(f"Корни квадратного уравнения t^2 + {q}t - {p**3/27} = 0: t1 = {t}\n")
print(f"Возвращаясь к переменным y: y1 = {y1}, y2 = {y2}, y3 = {y3}\n")
print(f"Корни исходного кубического уравнения: x1 = {x1}, x2 = {x2}, x3 = {x3}")