#(x0, y0), (x1, y1), (x2, y2), (x3, y3) - узлы интерполяции
print("Введите 4 узла интерполяции:")
x0, y0 = map(float, input("Введите x0 и y0 через пробел: ").split())
x1, y1 = map(float, input("Введите x1 и y1 через пробел: ").split())
x2, y2 = map(float, input("Введите x2 и y2 через пробел: ").split())
x3, y3 = map(float, input("Введите x3 и y3 через пробел: ").split())
print("Введите значение x, для которого нужно найти значение интерполяционного многочлена:")
x = float(input("x = "))

l0 = y0 * (((x-x1)*(x-x2)*(x-x3))/((x0-x1)*(x0-x2)*(x0-x3)))
l1 = y1 * (((x-x0)*(x-x2)*(x-x3))/((x1-x0)*(x1-x2)*(x1-x3)))
l2 = y2 * (((x-x0)*(x-x1)*(x-x3))/((x2-x0)*(x2-x1)*(x2-x3)))
l3 = y3 * (((x-x0)*(x-x1)*(x-x2))/((x3-x0)*(x3-x1)*(x3-x2)))
p = l0 + l1 + l2 + l3
print(f"Значение интерполяционного многочлена третьей степени: {p:.4g}")