import math
import matplotlib.pyplot as plt
arr = [0.74, 4.28, 7.10, 7.54, 1.77, 4.53, 5.48, 6.72, 5.38, 0.81,
       6.06, 5.06, 3.79, 9.49, 6.31, 2.44, 3.47, 7.57, 6.17, 4.12,
       5.84, 5.41, 4.36, 5.27, 2.34, 8.18, 4.75, 5.24, 8.22, 4.33,
       3.24, 7.33, 3.13, 6.56, 2.86, 8.39, 5.12, 4.38, 7.64, 7.90,
       5.65, 4.16, 4.84, 7.30, 6.52, 6.20, 6.05, 7.04, 8.96, 4.88,
       1.79, 5.98, 3.17, 5.55, 4.58, 4.33, 5.15, 5.86, 4.64, 6.20,
       6.68, 4.76, 6.46, 6.57, 5.72, 6.36, 2.60, 4.43, 11.10, 2.26,
       3.77, 3.02, 13.18, 9.42, 2.37, 6.70, 2.59, 5.71, 4.76, 1.66,
       7.13, 6.10, 4.84, 0.02, 4.25, 5.46, 7.47, 4.82, 4.87, 6.02, 
       6.89, 6.47, 8.79, 2.70, 7.81, 2.04, 2.81, 3.97, 8.01, 4.75]

arr.sort()
n = len(arr)

k = math.ceil(1 + 3.322 * math.log10(n))
step = (arr[-1] - arr[0]) / k

sum = 0
sum_q = 0
for i in range(len(arr)):
    sum += arr[i]
    sum_q += arr[i] ** 2

x_mean = sum / n
x_q_mean = sum_q / n

sigma_q = x_q_mean - x_mean ** 2
sigma = sigma_q ** 0.5

s_x = n/(n-1) * sigma_q
s_x2 = s_x ** 0.5

print(f"Отсортированный массив: {arr}\n")
print(f"Размер шага: {step:.4f}\n")
print(f"Среднее значение: {x_mean:.4f}\n")
print(f"Среднее значение квадратов: {x_q_mean:.4f}\n")
print(f"Сумма квадратов: {sum_q:.4f}\n")
print(f"Дисперсия: {sigma_q:.4f}\n")
print(f"Среднее квадратичное отклонение: {sigma:.4f}\n")
print(f"Несмещенная дисперсия: {s_x:.4f}\n")
print(f"Несмещенное среднее квадратичное отклонение: {s_x2:.4f}\n")

edges = [arr[0] + i * step for i in range(k + 1)]
edges[-1] = arr[-1]
plt.hist(arr, bins=edges, edgecolor='black')
plt.xlabel('x'); plt.ylabel('Частота $n_i$')
plt.title('Гистограмма')
plt.show()